# GridOutOfOrderError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..GridOutOfOrderError Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Curtain wall grid lines have changed order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridOutOfOrderError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridOutOfOrderError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridOutOfOrderError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace